/*
 Класс работы с кнопками ПОУ, управляемыми по последовательному порту
 Дребезг в этом случае осутствует 
 */
#ifndef C_KEYX
#define C_KEYX
 //========================================================================
 //---------------------------- ПОДКЛЮЧАЕМЫЕ ФАЙЛЫ ------------------------
 //========================================================================

 //========================================================================
 //-------------------------------- КОНСТАНТЫ -----------------------------
 //========================================================================

 //========================================================================
 //--------------------------- ОБЪЯВЛЕНИЕ КЛАССОВ -------------------------
 //========================================================================
 
class cKeyX{
 
 //------------------------------------------------------------------------
 // Атрибуты
 //------------------------------------------------------------------------

 
 char Name;               // Имя объекта
 //int Line;			          // Линия ввода данных
 
 bool Previous;		        // Предыдущее состояние кнопки
 
 bool IsEvent;            // Событие изменения состояния кнопки
 
 public:

 static long CurrentTime;  //Текущее значение миллисекундного таймера
 
 
 //------------------------------------------------------------------------
 // Методы
 //------------------------------------------------------------------------

 protected: 
 
 void eventGeneration();  // Генерация события
  
 public:
 
bool Current;           // Текущее состояние кнопки

static void getCurrentTime(); // Чтение текущего времени
 
 void operate();  // Реализация функциональности джойстика

 char getValue(); // Чтение текущего значения в символьном виде
 
 void install(char nameX);

 bool checkEvent(); // Проверка события клавиатуры
 
 //------------------------------------------------------------------------
 // Конструкторы
 //------------------------------------------------------------------------
 cKeyX();
 
};//End of class cKey

 //========================================================================
 //--------------------------- РЕАЛИЗАЦИЯ МЕТОДОВ -------------------------
 //========================================================================

//
// Конструктор
//
cKeyX::cKeyX(
    )
{
  //...
} 

//
// Начальная установка
//
void cKeyX::install(
    char nameX
  )
{
  this->Name = nameX;

  this->Current = false;
  this->Previous = this->Current;
}

//
// Реализация функциональности
//
void cKeyX::operate()
{
  if(this->Current != this->Previous)
  {
    this->Previous = this->Current;
    this->IsEvent = true;
  }
}//End of void cKeyX::operate()

//
// Чтение события клавиатуры
//
 bool cKeyX::checkEvent()
 {
    bool x = this->IsEvent;
    this->IsEvent = false;
    return x;
 }

//
// Чтение текущего значения
//

 char cKeyX::getValue()
 {
    if(this->Previous) return 0; else return 1;
 }

 //
 // Чтение текущего времени
 //
 void cKeyX::getCurrentTime()
 {
    cKeyX::CurrentTime = millis();
 }
//--------------------------------------------------------------------------------
//----------------------------------ОБЪЯВЛЕНИЕ СТАТИЧЕСКИХ ПЕРЕМЕННЫХ-------------
//--------------------------------------------------------------------------------
 long cKeyX::CurrentTime;


//--------------------------------------------------------------------------------
#endif
