/*
 Программа стенда-имитатора пульта командира и наводчика
 Для Arduino Mega в Ethernet shield задействованы выводы: 10, 4, 50, 52, 53, 51
 
 */

 //========================================================================
 //------------------------- АППАРАТНАЯ КОНФИГУРАЦИЯ ----------------------
 //========================================================================
  
  //========================================================================
 //--------------------------- ПОДКЛЮЧАЕМЫЕ МОДУЛИ ------------------------
 //========================================================================
 #include <Ethernet.h>
 #include <EthernetUdp.h>     

 #include "config.h"
 #include "cKeyX.h"
 #include "cLed.h"
 #include "cBuzer.h"
 #include "cEthernet.h"
 #include "cReady.h"
 #include "cKeyboard.h"
 #include "cDisplay.h"
 #include "cCommunication.h"
 #include "cSUO.h"
 #include "cRelay.h"
 #include "cPult.h"

     
 //========================================================================
 //-------------------------------- КОНСТАНТЫ -----------------------------
 //========================================================================
  
 
 //========================================================================
 //-------------------------- ГЛОБАЛЬНЫЕ ПЕРЕМЕННЫЕ -----------------------
 //========================================================================

 // Пульт
 cPult Pult;
 
// ===================== ПРОГРАММА НАЧАЛЬНОЙ УСТАНОВКИ ==============
void setup() 
{
  
  Pult.install();
  
}//End of setup

// ============================= ГЛАВНАЯ ПРОГРАММА ==================
void loop() 
{
  // Опорная временная точка
  cKeyX::getCurrentTime();
  
  //------------------- Реализация функциональности пульта ----------
  Pult.exec();
  //-----------------------------------------------------------------

}//End of loop


